ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_esm_safetyagg_regs.xml
<module id="ESM_SAFETYAGG_REGS" HW_revision="" description="ESM SAFETYAGG Registers">
	<register id="aggr_revision" width="32" page="0" offset="0" internal="0" description="Aggregator Revision Register">
		<bitfield id="scheme" description="" begin="31" end="30" width="2" rwaccess="R"/>
		<bitfield id="bu" description="" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="module_id" description="" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="revrtl" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="revmaj" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="custom" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="revmin" description="" begin="5" end="0" width="6" rwaccess="R"/>
	</register>
	<register id="ecc_vector" width="32" page="0" offset="8" internal="0" description="ECC Vector Register">
		<bitfield id="ecc_vector" description="" begin="10" end="0" width="11" rwaccess="RW"/>
		<bitfield id="rd_svbus" description="" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="rd_svbus_address" description="" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="rd_svbus_done" description="" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="misc_status" width="32" page="0" offset="12" internal="0" description="Misc Status">
		<bitfield id="num_rams" description="" begin="10" end="0" width="11" rwaccess="R"/>
	</register>
	<group id="EdcRegs" name="EdcRegs" instances="1" offset="0x10">
		<register id="REVISION" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Revision Register ">
			<bitfield id="MINOR" description="Minor revision of module" begin="5" end="0" width="6" rwaccess="R"/>
			<bitfield id="CUSTOM" description="Special version" begin="7" end="6" width="2" rwaccess="R"/>
			<bitfield id="MAJOR" description="Major revision of module" begin="10" end="8" width="3" rwaccess="R"/>
			<bitfield id="RTL" description="RTL version of the module" begin="15" end="11" width="5" rwaccess="R"/>
			<bitfield id="FUNC" description="Assigned func id" begin="27" end="16" width="12" rwaccess="R"/>
			<bitfield id="SCHEME" description="Reserved" begin="31" end="30" width="2" rwaccess="R"/>
		</register>
		<register id="CONTROL" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Control Register ">
			<bitfield id="ECCCHECK" description="Enable ECC Checkers" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="FORCE_SE" description="Inject Single bit error" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="FORCE_DE" description="Inject Double bit error" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="FORCE_N_BIT" description="Incremental Injection" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="ECC_PATTERN" description="Data Pattern" begin="11" end="8" width="4" rwaccess="RW"/>
		</register>
		<register id="ERROR1" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="Error 1 Register">
			<bitfield id="ECCGRP" description="Group of Checker to inject" begin="15" end="0" width="16" rwaccess="RW"/>
			<bitfield id="ECCBIT1" description="ECC BIT1" begin="24" end="16" width="9" rwaccess="RW"/>
		</register>
		<register id="ERROR2" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="Error 2 Register">
			<bitfield id="ECCBIT2" description="ECC BIT2" begin="8" end="0" width="9" rwaccess="RW"/>
		</register>
		<register id="ERRORSTATUS1" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="Error Status 1 Register">
			<bitfield id="COR_PEND" description="Correctable Pending" begin="1" end="0" width="2" rwaccess="RW"/>
			<bitfield id="UNCOR_PEND" description="Uncorrectable Pending" begin="3" end="2" width="2" rwaccess="RW"/>
			<bitfield id="INJ_COR_PEND" description="Injected correctable pending interrupts" begin="5" end="4" width="2" rwaccess="RW"/>
			<bitfield id="INJ_UNCOR_PEND" description="Injected uncorrectable pending interrupts" begin="7" end="6" width="2" rwaccess="RW"/>
			<bitfield id="COR_PEND_CLR" description="Correctable pending interrupts" begin="9" end="8" width="2" rwaccess="RW"/>
			<bitfield id="UNCOR_PEND_CLR" description="Uncorrectable pending interrupts" begin="11" end="10" width="2" rwaccess="RW"/>
			<bitfield id="INJ_COR_PEND_CLR" description="Injected correctable pending interrupts" begin="13" end="12" width="2" rwaccess="RW"/>
			<bitfield id="INJ_UNCOR_PEND_CLR" description="Injected uncorrectable pending interrupts" begin="15" end="14" width="2" rwaccess="RW"/>
			<bitfield id="ERR_GROUP" description="Specify Checker that reported Error" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
		<register id="ERRORSTATUS2" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="Error Status 2 Register">
			<bitfield id="ERR_BIT" description="error bit" begin="15" end="0" width="16" rwaccess="R"/>
			<bitfield id="ERROR_TYPE" description="ERROR Type" begin="31" end="16" width="16" rwaccess="R"/>
		</register>
	</group>
	<register id="ded_eoi_reg" width="32" page="0" offset="316" internal="0" description="EOI Register">
		<bitfield id="eoi_wr" description="" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ded_status_reg0" width="32" page="0" offset="320" internal="0" description="Interrupt Status Register 0">
		<bitfield id="esmss_sys_esm_edc_ctrl_busecc_pend" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm0_edc_ctrl_busecc_pend" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm1_edc_ctrl_busecc_pend" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm2_edc_ctrl_busecc_pend" description="" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ded_enable_set_reg0" width="32" page="0" offset="384" internal="0" description="Interrupt Enable Set Register 0">
		<bitfield id="esmss_sys_esm_edc_ctrl_busecc_enable_set" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm0_edc_ctrl_busecc_enable_set" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm1_edc_ctrl_busecc_enable_set" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm2_edc_ctrl_busecc_enable_set" description="" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ded_enable_clr_reg0" width="32" page="0" offset="448" internal="0" description="Interrupt Enable Clear Register 0">
		<bitfield id="esmss_sys_esm_edc_ctrl_busecc_enable_clr" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm0_edc_ctrl_busecc_enable_clr" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm1_edc_ctrl_busecc_enable_clr" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="esmss_esm2_edc_ctrl_busecc_enable_clr" description="" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="aggr_enable_set" width="32" page="0" offset="512" internal="0" description="AGGR interrupt enable set Register">
		<bitfield id="parity" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="timeout" description="" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="aggr_enable_clr" width="32" page="0" offset="516" internal="0" description="AGGR interrupt enable clear Register">
		<bitfield id="parity" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="timeout" description="" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="aggr_status_set" width="32" page="0" offset="520" internal="0" description="AGGR interrupt status set Register">
		<bitfield id="parity" description="" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="timeout" description="" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="aggr_status_clr" width="32" page="0" offset="524" internal="0" description="AGGR interrupt status clear Register">
		<bitfield id="parity" description="" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="timeout" description="" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
</module>
